      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.3.1 - 28.01.2012 - mailto:thomas.raddatz@tools400.de')
      /eof
      /endif
     D PRTLOG_VERSION...
     D                 C                   '1.3.1'
     D PRTLOG_DATE...
     D                 C                   '28.01.2012'
