**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.4 - 01.06.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c PRTLOG_VERSION '1.4';
dcl-c PRTLOG_DATE '01.06.2026';
